import { GlossaryDefine } from "../GlossaryDefine";

export const NPCsDefine: GlossaryDefine = {
    categories: [
        {
            categoryName: "メイプルワールド",
            subCategories:[
                {
                    subCategoryName: "ヘネシス",
                    words:[
                        {
                            name: <>ヘレナ</>,
                            description: <>
                                <p>ヘネシスにある弓使い学院の学長。</p>
                                <p>初心者冒険者を一人前の弓使いに育てる役割を持つ他、勝手気ままな冒険者達の顔役。</p>
                                <p>見た目の通りエルフであり、英雄が暗黒の魔法使いを封印した時代から生きている。エルフの王たるメルセデスとは旧知の仲。</p>
                            </>
                        },
                        {
                            name: <>長老スタン</>,
                            description: <>
                                <p>ヘネシスの長老。人間。</p>
                                <p>妻にMrsミンミン、息子にアレックスがいるが、アレックスはカニングシティーに家出中。</p>
                                <p>長老とアレックスの仲を取り持つクエストがある。</p>
                            </>
                        },
                        {
                            name: <>Mrsミンミン</>,
                            description: <>
                                <p>ヘネシスの長老スタンの妻。</p>
                                <p>長老スタンに記念日を忘れられたことを根に持っている。</p>
                                <p>息子はアレックスだが、血のつながりがあるわけではないようだ。</p>
                            </>
                        }
                    ]
                }
            ]
        },
        {
            categoryName: "グランディス",
            subCategories:[
                {
                    subCategoryName: "セルニウム",
                    words: [
                        {
                            name: "カーライル",
                            description: <>
                                <p>グランディスの聖地セルニウムの王子。</p>
                                <p>ゼルン・ダルモアに対抗するする力を求めてメイプル連合に取引を持ちかけた。</p>
                                <p>セルニウムの世論が敵にプレイヤーを引き渡そうと傾いたとき、反対意見を唱えて守ってくれた。</p>
                            </>
                        },
                        {
                            name: "セレン",
                            description: <>
                                <p>セルニウムの聖剣アソールの守護者。</p>
                                <p>過去のトラウマから自分が剣の真の主ではないと悩んだり、太陽神ミトラに意識を乗っ取られてプレイヤーと戦ったりする。</p>
                                <p>後々太陽神ミトラと再び遭遇するが、自分の意思でミトラとは別の道のりを歩み始める。</p>
                            </>
                        },
                        {
                            name: "アロン",
                            description: <>
                                <p>セルニウムの図書館長。ハイレフ。</p>
                                <p>セルニウムに対する侵攻が退けられた後、グランディスの生命の超越者ゼルン・ダルモアとしての正体を現す。</p>
                                <p>太陽神ミトラを叩き起こしてプレイヤーにぶつけ、傷ついたプレイヤーの中にある封印石を破壊し去ってゆく。</p>
                            </>
                        }
                    ]
                }
            ]
        }
    ]
}